12/data/attachments/f3543d2f11460cbe.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:username>
            <nif:friendToBeAdded>Cole_weight_Friend_71057_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>